name: "PA100KCaffeNet"
layer {
  name: "mldata"
  type: "MultiLabelData"
  top: "data"
  top: "label"
  data_param {
    source: "/home/jh/working_data/PA-100K/train_lmdb"
    batch_size: 512
		backend: LMDB
  }
  transform_param {
    crop_size: 227
		mean_value: 104
		mean_value: 117
		mean_value: 123
    mirror: true
		scale: 0.00390625
  }
  include: { phase: TRAIN }
}
layer {
  name: "mldata"
  type: "MultiLabelData"
  top: "data"
  top: "label"
  data_param {
    source: "/home/jh/working_data/PA-100K/val_lmdb"
    batch_size: 256
		backend: LMDB
  }
  transform_param {
    crop_size: 227
		mean_value: 104
		mean_value: 117
		mean_value: 123
    mirror: false
		scale: 0.00390625
  }
  include: { phase: TEST }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8_PA100K_26"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8_PA100K_26"
  param {
    lr_mult: 2
    decay_mult: 1
  }
  param {
    lr_mult: 4
    decay_mult: 0
  }
  inner_product_param {
    num_output: 26
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "mlloss"
  type: "MultiLabelSigmoidCrossEntropyLoss"
  bottom: "fc8_PA100K_26"
  bottom: "label"
	top: "Multi Label Loss"

  multi_label_sigmoid_cross_entropy_loss{
    epsilon : 1
    positive_ratio : 0.49
    positive_ratio : 0.0084
    positive_ratio : 0.84
    positive_ratio : 0.14332
    positive_ratio : 0.3020
    positive_ratio : 0.3807
    positive_ratio : 0.3172
    positive_ratio : 0.0404
    positive_ratio : 0.1868
    positive_ratio : 0.1974
    positive_ratio : 0.2043
    positive_ratio : 0.2588
    positive_ratio : 0.0083
    positive_ratio : 0.561
    positive_ratio : 0.4387
    positive_ratio : 0.038
    positive_ratio : 0.1267
    positive_ratio : 0.100
    positive_ratio : 0.0254
    positive_ratio : 0.00199
    positive_ratio : 0.0097
    positive_ratio : 0.067
    positive_ratio : 0.734
    positive_ratio : 0.169
    positive_ratio : 0.096
    positive_ratio : 0.00457
 }
}

layer {
	name: "sigmoid"
	type: "Sigmoid"
	bottom: "fc8_PA100K_26"
	top: "sigmoid_fc8_PA100K_26"
	include: { phase: TEST }
}

layer {
  name: "mlaccuracy"
  type: "MultiLabelAccuracy"
  bottom: "sigmoid_fc8_PA100K_26"
  bottom: "label"
  top: "accuracy_whole"
  top: "accuracy_per_class"
  include: { phase: TEST }
}
